-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\home\stephenj\MYDocs\REF\_Stata_Journal_editor\kolenikov_infere
> nce-imputed-latent-classes\2025.03.04.kolenikov_submission\postlca-simul_spj.
> log
  log type:  text
 opened on:   8 Jun 2025, 11:45:43

. 
. ***** SPJ version *******
. 
. 
. * Simulation for postlca_class_predpute
. 
. args reps

. 
. if "`reps'"=="" local reps 50

. 
. * (i) Simulate data
. cap program drop simulate_lca_sample

. program define simulate_lca_sample
  1. 
.     syntax , n(integer) [ seed(integer 0) classprob(namelist min=1) ]
  2. 
.     drop _all 
  3. 
.     if "`seed'" != "0" {
  4.         set seed `seed'
  5.     }
  6. 
.     if "`classprob'" == "" {
  7.         * this will be a matrix
.         tempname classprob
  8.         matrix `classprob' = (    ///
>             0.7, 0.8, 0.5, 0.5, 0.8 \  ///
>             0.3, 0.5, 0.4, 0.3, 0.4 \  ///
>             0.6, 0.6, 0.7, 0.7, 0.3    ///
>         )
  9.     }
 10. 
.     set obs `n'
 11. 
.     gen byte class = floor( (_n-1) / (_N/2.5) ) + 1
 12. 
.     * outcome probabilities
.     forvalues k=1/5 {
 13.         gen byte y`k' = runiform() < `classprob'[class, `k']
 14.     }
 15. 
.     gen double y6 = sqrt(class) + rnormal()
 16. 
. end // of simulate

. 
. * (ii) helper functions
. cap pro drop postlca_deterministic

. program define postlca_deterministic, rclass
  1. 
.     syntax // nothing
  2. 
.         if "`e(cmd)'" != "gsem" | "`e(lclass)'" == "" {
  3.                 di as err "gsem, lclass() LCA results not found"
  4.                 exit (301)
  5.         }
  6. 
.     tempname lca    
  7.     est store `lca'
  8. 
.     predict pclass1, classposterior class(1)
  9.     predict pclass2, classposterior class(2)
 10.     predict pclass3, classposterior class(3)
 11. 
.     gen byte pred_class = cond(pclass1 > pclass2 & pclass1 > pclass3, 1, ///
>                         cond(pclass2 > pclass1 & pclass2 > pclass3, 2, 3))
 12. 
.     // class post
.     mean ibn.pred_class
 13.         forvalues c=1/3 {
 14.                 cap di _b[`c'.pred_class]
 15.                 if _rc == 0 local classpost `classpost' (`=_b[`c'.pred_cla
> ss]') (`=_se[`c'.pred_class]')
 16.                 else local classpost `classpost' (.) (.)
 17.         }
 18.                 
.     // long ypost
.     mean y* , over(pred_class)
 19.     forvalues k=1/6 {
 20.         forvalues c=1/3 {
 21.                         cap di _b[c.y`k'@`c'.pred_class]
 22.                         if _rc  local ypost `ypost' (.) (.)
 23.                         else    local ypost `ypost' (`=_b[c.y`k'@`c'.pred_
> class]') (`=_se[c.y`k'@`c'.pred_class]')
 24.         }
 25.     }
 26. 
.     est restore `lca'
 27.     cap est drop `lca'
 28. 
.     return local topost "`classpost' `ypost' (.) (.)"
 29. 
. end // of postlca_deterministic

. 
. cap pro drop postlca_mi

. program define postlca_mi, rclass
  1. 
.     syntax , m(integer)
  2. 
.         if "`e(cmd)'" != "gsem" | "`e(lclass)'" == "" {
  3.                 di as err "gsem, lclass() LCA results not found"
  4.                 exit (301)
  5.         }
  6. 
.     tempname lca    
  7.     est store `lca'
  8. 
.     // class post
.     mi estimate , imp(1/`m') post esampvaryok errorok nowarning : prop lclass
> , coeflegend
  9.     local classpost (`=_b[1.lclass]') (`=_se[1.lclass]') ///
>         (`=_b[2.lclass]') (`=_se[2.lclass]') ///
>         (`=_b[3.lclass]') (`=_se[3.lclass]')    
 10. 
.     // ypost
.     mi estimate , imp(1/`m') post esampvaryok errorok nowarning : mean y*, ov
> er(lclass) coeflegend
 11.     forvalues k=1/6 {
 12.         forvalues c=1/3 {
 13.             local ypost `ypost' (`=_b[c.y`k'@`c'.lclass]') (`=_se[c.y`k'@`
> c'.lclass]')
 14.         }
 15.     }
 16. 
.     local e_df_min_mi = e(df_min_mi)
 17.     local e_fmi_max_mi = e(fmi_max_mi)
 18. 
.     est restore `lca'
 19.     cap est drop `lca'
 20. 
.     return local topost "`classpost' `ypost' (`e_df_min_mi') (`e_fmi_max_mi')
> " 
 21. 
. end // of postlca_mi5 

. 
. * (iii) try once
. simulate_lca_sample, n(10000) seed(1234)
Number of observations (_N) was 0, now 10,000.

.     
. gsem (y1 y2 y3 y4 y5 <-), logit lclass(C 3) startvalues(classid class) diffic
> ult iter(50)

Fitting class model:

Iteration 0:  (class) log likelihood = -10549.202  
Iteration 1:  (class) log likelihood = -10549.202  

Fitting outcome model:

Iteration 0:  (outcome) log likelihood = -31334.782  
Iteration 1:  (outcome) log likelihood = -31292.666  
Iteration 2:  (outcome) log likelihood =  -31292.64  
Iteration 3:  (outcome) log likelihood =  -31292.64  

Refining starting values:

Iteration 0:  (EM) log likelihood = -41898.595
Iteration 1:  (EM) log likelihood = -41933.437
Iteration 2:  (EM) log likelihood = -41955.037
Iteration 3:  (EM) log likelihood = -41968.333
Iteration 4:  (EM) log likelihood =  -41976.28
Iteration 5:  (EM) log likelihood = -41980.714
Iteration 6:  (EM) log likelihood = -41982.804
Iteration 7:  (EM) log likelihood = -41983.318
Iteration 8:  (EM) log likelihood =  -41982.77
Iteration 9:  (EM) log likelihood = -41981.498
Iteration 10: (EM) log likelihood =  -41979.74
Iteration 11: (EM) log likelihood = -41977.661
Iteration 12: (EM) log likelihood = -41975.377
Iteration 13: (EM) log likelihood = -41972.968
Iteration 14: (EM) log likelihood = -41970.491
Iteration 15: (EM) log likelihood = -41967.988
Iteration 16: (EM) log likelihood = -41965.486
Iteration 17: (EM) log likelihood = -41963.006
Iteration 18: (EM) log likelihood =  -41960.56
Iteration 19: (EM) log likelihood = -41958.158
Iteration 20: (EM) log likelihood = -41955.806
note: EM algorithm reached maximum iterations.

Fitting full model:

Iteration 0:  Log likelihood =   -33918.5  
Iteration 1:  Log likelihood = -33918.291  
Iteration 2:  Log likelihood = -33918.263  
Iteration 3:  Log likelihood = -33918.262  

Generalized structural equation model                   Number of obs = 10,000
Log likelihood = -33918.262

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1.C          |  (base outcome)
-------------+----------------------------------------------------------------
2.C          |
       _cons |   .0297933   .2822678     0.11   0.916    -.5234414     .583028
-------------+----------------------------------------------------------------
3.C          |
       _cons |  -.9286666   .5425421    -1.71   0.087     -1.99203    .1346964
------------------------------------------------------------------------------

Class:    1        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |   .8321654   .1129785     7.37   0.000     .6107316    1.053599
-------------+----------------------------------------------------------------
y2           |
       _cons |   1.303646   .1305913     9.98   0.000     1.047692      1.5596
-------------+----------------------------------------------------------------
y3           |
       _cons |   .0398783   .0719365     0.55   0.579    -.1011147    .1808712
-------------+----------------------------------------------------------------
y4           |
       _cons |    .040157   .0851204     0.47   0.637    -.1266759    .2069899
-------------+----------------------------------------------------------------
y5           |
       _cons |   1.349524   .3266263     4.13   0.000     .7093483      1.9897
------------------------------------------------------------------------------

Class:    2        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |  -.8071376   .1480033    -5.45   0.000    -1.097219   -.5170565
-------------+----------------------------------------------------------------
y2           |
       _cons |   .0884467   .0718281     1.23   0.218    -.0523338    .2292272
-------------+----------------------------------------------------------------
y3           |
       _cons |  -.3236774   .0901974    -3.59   0.000     -.500461   -.1468937
-------------+----------------------------------------------------------------
y4           |
       _cons |  -.9075783   .1684406    -5.39   0.000    -1.237716   -.5774408
-------------+----------------------------------------------------------------
y5           |
       _cons |  -.4430726   .0991491    -4.47   0.000    -.6374012    -.248744
------------------------------------------------------------------------------

Class:    3        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |    .441602   .2305796     1.92   0.055    -.0103256    .8935296
-------------+----------------------------------------------------------------
y2           |
       _cons |   .4650815   .1897136     2.45   0.014     .0932497    .8369132
-------------+----------------------------------------------------------------
y3           |
       _cons |   .8294621   .2573724     3.22   0.001     .3250215    1.333903
-------------+----------------------------------------------------------------
y4           |
       _cons |   1.063104   .4623545     2.30   0.021     .1569056    1.969302
-------------+----------------------------------------------------------------
y5           |
       _cons |  -1.028376   .5393949    -1.91   0.057    -2.085571    .0288185
------------------------------------------------------------------------------

. 
. postlca_deterministic

Mean estimation                         Number of obs = 10,000

--------------------------------------------------------------
             |       Mean   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
  pred_class |
          1  |      .4379   .0049615      .4281744    .4476256
          2  |       .468     .00499      .4582186    .4777814
          3  |      .0941   .0029198      .0883766    .0998234
--------------------------------------------------------------

Mean estimation                            Number of obs = 10,000

-----------------------------------------------------------------
                |       Mean   Std. err.     [95% conf. interval]
----------------+------------------------------------------------
c.y1@pred_class |
             1  |   .7609043   .0064463      .7482682    .7735404
             2  |   .2596154   .0064094      .2470517    .2721791
             3  |   .6673751   .0153673      .6372521    .6974982
                |
c.y2@pred_class |
             1  |   .8093172   .0059371      .7976792    .8209552
             2  |   .4675214   .0072942      .4532233    .4818194
             3  |   .7747078   .0136263      .7479975    .8014181
                |
c.y3@pred_class |
             1  |   .5188399   .0075513      .5040378     .533642
             2  |   .3861111   .0071175      .3721595    .4000627
             3  |          1          0             .           .
                |
c.y4@pred_class |
             1  |   .5546929   .0075114      .5399691    .5694166
             2  |   .2489316   .0063213      .2365407    .2613226
             3  |          1          0             .           .
                |
c.y5@pred_class |
             1  |   .9362868   .0036913      .9290511    .9435225
             2  |   .2700855    .006491      .2573618    .2828091
             3  |          0  (omitted)
                |
c.y6@pred_class |
             1  |   1.158981    .015544      1.128511     1.18945
             2  |   1.421474   .0149825      1.392105    1.450842
             3  |   1.477682   .0330608      1.412876    1.542488
-----------------------------------------------------------------
(results __000000 are active now)

. di "`r(topost)'"
(.4379) (.0049615341057046) (.468) (.0049899989988977) (.0941) (.00291982388803
> 74) (.7609043160538936) (.0064463371141471) (.2596153846153846) (.00640940009
> 95338) (.667375132837407) (.0153673308119772) (.8093171957067824) (.005937139
> 7356999) (.4675213675213675) (.0072941602799379) (.7747077577045696) (.013626
> 3062171812) (.5188399177894496) (.0075513327432083) (.3861111111111111) (.007
> 117451453499) (1) (0) (.554692852249372) (.007511354157373) (.248931623931623
> 9) (.0063212541489384) (1) (0) (.9362868234756794) (.0036913158389042) (.2700
> 854700854701) (.0064909773295316) (0) (0) (1.158980663936022) (.0155439824619
> 143) (1.421473730412442) (.0149825148936953) (1.477682013382779) (.0330608187
> 768146) (.) (.)

. 
. postlca_class_predpute, lcimpute(lclass) addm(50) seed(12345)
(10,000 missing values generated)
(50 imputations added; M = 50)

. 
. postlca_mi, m(5)

Multiple-imputation estimates     Imputations     =          5
Proportion estimation             Number of obs   =     10,000
                                  Average RVI     =     0.2339
                                  Largest FMI     =     0.3148
                                  Complete DF     =       9999
DF adjustment:   Small sample     DF:     min     =      48.20
                                          avg     =      62.56
Within VCE type:     Analytic             max     =      72.59

--------------------------------------------------------------
             |                                   Normal
             | Proportion   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      lclass |
          1  |     .41424   .0056634      .4029355    .4255445
          2  |       .423   .0056433      .4117519    .4342481
          3  |     .16276    .004372      .1539705    .1715495
--------------------------------------------------------------

Multiple-imputation estimates     Imputations     =          5
Mean estimation                   Number of obs   =     10,000
                                  Average RVI     =     0.5507
                                  Largest FMI     =     0.6260
                                  Complete DF     =       9999
DF adjustment:   Small sample     DF:     min     =      12.29
                                          avg     =      85.65
Within VCE type:     Analytic             max     =     290.56

--------------------------------------------------------------
             |       Mean   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
 c.y1@lclass |
          1  |   .6968821   .0083027      .6802664    .7134978
          2  |   .3049023   .0097818      .2843155    .3254891
          3  |   .6134533   .0184039      .5734578    .6534488
             |
 c.y2@lclass |
          1  |   .7859312   .0078883      .7698825    .8019799
          2  |   .5197239   .0086666      .5024961    .5369517
          3  |   .6187054   .0143985      .5896877    .6477231
             |
 c.y3@lclass |
          1  |    .510231   .0114405      .4856473    .5348148
          2  |   .4189354   .0113915      .3943021    .4435686
          3  |   .6970304    .016428      .6619731    .7320877
             |
 c.y4@lclass |
          1  |   .5095529   .0083219       .493158    .5259478
          2  |   .2889733   .0074109      .2743873    .3035592
          3  |    .738367   .0117505      .7151964    .7615376
             |
 c.y5@lclass |
          1  |   .7924865   .0067206      .7792542    .8057189
          2  |   .3910993   .0088012      .3734481    .4087504
          3  |   .2621978   .0126078      .2369994    .2873962
             |
 c.y6@lclass |
          1  |   1.214777   .0197612      1.174649    1.254905
          2  |   1.376111   .0184997       1.33903    1.413192
          3  |   1.391874   .0300416      1.331587    1.452161
--------------------------------------------------------------
Note: Numbers of observations in e(_N) vary among imputations.
(results __000000 are active now)

. di "`r(topost)'"
(.4142400000000001) (.0056633560368389) (.423) (.0056432795429608) (.16276) (.0
> 04371973513186) (.6968820663520403) (.0083027123212516) (.3049023411847133) (
> .0097818067384536) (.6134533372097065) (.0184039165035216) (.7859312058572462
> ) (.0078883448406267) (.519723902249915) (.0086665519672816) (.61870540739335
> 37) (.0143984880280399) (.5102310465192683) (.0114405255481024) (.41893536049
> 41514) (.0113914513332026) (.6970304002741304) (.0164279646560335) (.50955286
> 74753395) (.0083218525500043) (.2889732749953296) (.0074109386797664) (.73836
> 69899067569) (.0117504517768821) (.7924865431933086) (.0067205876376519) (.39
> 10992883119978) (.0088012476925875) (.2621978014000322) (.0126078059427431) (
> 1.214777153764631) (.0197612075403033) (1.376110932790153) (.0184996603045938
> ) (1.391873983594807) (.0300416210432152) (12.28574211011986) (.6259966249072
> 425)

. 
. postlca_mi, m(50)

Multiple-imputation estimates     Imputations     =         50
Proportion estimation             Number of obs   =     10,000
                                  Average RVI     =     0.7453
                                  Largest FMI     =     0.4641
                                  Complete DF     =       9999
DF adjustment:   Small sample     DF:     min     =     222.62
                                          avg     =     268.24
Within VCE type:     Analytic             max     =     309.00

--------------------------------------------------------------
             |                                   Normal
             | Proportion   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      lclass |
          1  |    .412726   .0064289      .4000695    .4253825
          2  |    .424394   .0063179      .4119625    .4368255
          3  |     .16288   .0050219      .1529835    .1727765
--------------------------------------------------------------

Multiple-imputation estimates     Imputations     =         50
Mean estimation                   Number of obs   =     10,000
                                  Average RVI     =     0.5290
                                  Largest FMI     =     0.4471
                                  Complete DF     =       9999
DF adjustment:   Small sample     DF:     min     =     239.40
                                          avg     =     438.66
Within VCE type:     Analytic             max     =     939.05

--------------------------------------------------------------
             |       Mean   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
 c.y1@lclass |
          1  |   .6975081   .0087747      .6802588    .7147574
          2  |   .3073926   .0086308      .2904288    .3243564
          3  |   .6088556   .0162002      .5769425    .6407688
             |
 c.y2@lclass |
          1  |   .7853382   .0075326      .7705434    .8001329
          2  |   .5223045   .0091898      .5042486    .5403605
          3  |   .6158125   .0148082       .586702     .644923
             |
 c.y3@lclass |
          1  |   .5096196   .0095144      .4909176    .5283215
          2  |   .4199624   .0089246      .4024337     .437491
          3  |   .6963848   .0141348       .668592    .7241776
             |
 c.y4@lclass |
          1  |   .5093109   .0087802      .4920797     .526542
          2  |   .2879135   .0080902      .2720274    .3037996
          3  |   .7434461   .0138609      .7161712    .7707209
             |
 c.y5@lclass |
          1  |   .7949985   .0083362      .7785808    .8114162
          2  |   .3901538   .0094665      .3715317    .4087759
          3  |   .2621972   .0144443      .2337507    .2906438
             |
 c.y6@lclass |
          1  |   1.215576   .0197463      1.176759    1.254393
          2  |   1.374147   .0187937      1.337228    1.411065
          3  |   1.393391    .032743      1.328953    1.457829
--------------------------------------------------------------
Note: Numbers of observations in e(_N) vary among imputations.
(results __000000 are active now)

. di "`r(topost)'"
(.412726) (.0064288843867632) (.424394) (.0063178505415778) (.16288) (.00502189
> 52730894) (.6975080903452664) (.0087746762239218) (.3073926199394955) (.00863
> 08140230685) (.6088556381836593) (.0162001940173932) (.7853381805575586) (.00
> 75326055121016) (.5223045369586519) (.0091897922096317) (.6158124810628114) (
> .0148081689158914) (.5096195951342047) (.0095144413845377) (.4199623604018765
> ) (.008924613750162) (.6963847885884554) (.0141347554900214) (.50931086523713
> 36) (.0087802436144468) (.2879135071309048) (.0080902333295881) (.74344605430
> 34531) (.013860916353643) (.7949985037189282) (.0083361709631372) (.390153760
> 1952045) (.009466532540874) (.2621972196552466) (.0144443199785891) (1.215575
> 894017976) (.0197462792275334) (1.374146549891731) (.0187936568807088) (1.393
> 391008908473) (.0327430312348123) (239.4015882719555) (.4470760804434445)

. 
. * (iii) best initial values
. cap mat li b0

. if _rc {
.     clear
.     simulate_lca_sample, n(1e6) seed(1234)
Number of observations (_N) was 0, now 1,000,000.
.     gsem (y1 y2 y3 y4 y5 <-), logit lclass(C 3) startvalues(classid class) di
> fficult ///
>         tech(bhhh 50 dfp 20 bfgs 20 nr 100) iter(100) nonrtolerance

Fitting class model:

Iteration 0:  (class) log likelihood = -1054920.2  
Iteration 1:  (class) log likelihood = -1054920.2  

Fitting outcome model:

Iteration 0:  (outcome) log likelihood = -3144867.9  
Iteration 1:  (outcome) log likelihood = -3140661.3  
Iteration 2:  (outcome) log likelihood = -3140658.8  
Iteration 3:  (outcome) log likelihood = -3140658.8  

Refining starting values:

Iteration 0:  (EM) log likelihood = -4196238.4
Iteration 1:  (EM) log likelihood = -4196663.1
Iteration 2:  (EM) log likelihood = -4196939.1
Iteration 3:  (EM) log likelihood = -4197119.4
Iteration 4:  (EM) log likelihood = -4197237.1
Iteration 5:  (EM) log likelihood =   -4197313
Iteration 6:  (EM) log likelihood = -4197360.8
Iteration 7:  (EM) log likelihood = -4197389.2
Iteration 8:  (EM) log likelihood = -4197404.5
Iteration 9:  (EM) log likelihood = -4197410.5
Iteration 10: (EM) log likelihood = -4197410.2

Fitting full model:

(setting technique to bhhh)
Iteration 0:  Log likelihood = -3395239.1  
Iteration 1:  Log likelihood = -3395237.4  
Iteration 2:  Log likelihood = -3395237.4  

Generalized structural equation model                Number of obs = 1,000,000
Log likelihood = -3395237.4

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1.C          |  (base outcome)
-------------+----------------------------------------------------------------
2.C          |
       _cons |   .0071411   .0291083     0.25   0.806    -.0499102    .0641924
-------------+----------------------------------------------------------------
3.C          |
       _cons |  -.6419899    .058961   -10.89   0.000    -.7575513   -.5264284
------------------------------------------------------------------------------

Class:    1        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |   .8282933   .0116371    71.18   0.000      .805485    .8511016
-------------+----------------------------------------------------------------
y2           |
       _cons |   1.380145   .0162064    85.16   0.000     1.348381    1.411909
-------------+----------------------------------------------------------------
y3           |
       _cons |  -.0061492   .0082256    -0.75   0.455    -.0222711    .0099726
-------------+----------------------------------------------------------------
y4           |
       _cons |  -.0163463   .0085703    -1.91   0.056    -.0331438    .0004512
-------------+----------------------------------------------------------------
y5           |
       _cons |   1.417253   .0360662    39.30   0.000     1.346564    1.487941
------------------------------------------------------------------------------

Class:    2        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |  -.8381129   .0151484   -55.33   0.000    -.8678031   -.8084226
-------------+----------------------------------------------------------------
y2           |
       _cons |   .0001758   .0082111     0.02   0.983    -.0159177    .0162694
-------------+----------------------------------------------------------------
y3           |
       _cons |  -.4013666   .0105061   -38.20   0.000    -.4219581   -.3807751
-------------+----------------------------------------------------------------
y4           |
       _cons |  -.8476089   .0156914   -54.02   0.000    -.8783634   -.8168544
-------------+----------------------------------------------------------------
y5           |
       _cons |   -.418664   .0098608   -42.46   0.000    -.4379908   -.3993373
------------------------------------------------------------------------------

Class:    3        

Response: y1       
Family:   Bernoulli
Link:     Logit    

Response: y2       
Family:   Bernoulli
Link:     Logit    

Response: y3       
Family:   Bernoulli
Link:     Logit    

Response: y4       
Family:   Bernoulli
Link:     Logit    

Response: y5       
Family:   Bernoulli
Link:     Logit    

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       _cons |   .4219332    .018895    22.33   0.000     .3848997    .4589668
-------------+----------------------------------------------------------------
y2           |
       _cons |   .4386338   .0161595    27.14   0.000     .4069618    .4703058
-------------+----------------------------------------------------------------
y3           |
       _cons |   .8191592   .0277826    29.48   0.000     .7647062    .8736121
-------------+----------------------------------------------------------------
y4           |
       _cons |   .8308593   .0341477    24.33   0.000     .7639311    .8977876
-------------+----------------------------------------------------------------
y5           |
       _cons |  -.8041827   .0419737   -19.16   0.000    -.8864496   -.7219158
------------------------------------------------------------------------------
.     mat b0 = e(b)
. }

. 
. * (iv) Post set up
. frame change default

. cap frame post_results: drop _all

. cap frame drop post_results

. 
. cap postclose topost

. forvalues i=1/6 {
  2.     forvalues j=1/3 {
  3.         local ypost `ypost' y`i'cl`j'pr y`i'cl`j'se
  4.     }
  5. }

. 
. frame create post_results ///
>     int(rep) str12(method) double(seed) ///
>     double(class1pr class1se class2pr class2se class3pr class3se) ///
>     double(`ypost') ///
>     double(df_min_mi fmi_max_mi) 

. 
. * (v) simulate
. timer clear 11

. forvalues r=1/`reps' {
  2. 
.     if `r'==1 _dots 0 0, reps(`reps') title("Simulation replications")
  3. 
.     timer on 11
  4. 
.     quietly {
  5.         * (v.a) simulate the sample
.                 local this_seed `reps'`r'
  6.         simulate_lca_sample, n(1000) seed(`this_seed')
  7.         
.         * (v.b) run LCA
.         cap ///
>             gsem (y1 y2 y3 y4 y5 <-), logit lclass(C 3) from(b0) ///
>                 startvalues(jitter 0.1, draws(10)) iter(100) ///
>                                 difficult tech(bhhh 50 dfp 20 bfgs 20 nr 10) 
> nonrtolerance
  8. 
.         local rc_gsem = _rc
  9.         if `rc_gsem' == 0 {
 10. 
.             * (v.c) deterministic
.             cap postlca_deterministic
 11.             local rc_post = _rc
 12.             cap frame post post_results (`r') ("modal") (`this_seed') `r(t
> opost)'
 13.             local rc_post = _rc + `rc_post'
 14. 
.             * (v.d) imputed
.             postlca_class_predpute, lcimpute(lclass) addm(50) seed(`r'`r')
 15. 
.             * (v.e) M=5
.             cap postlca_mi, m(5)
 16.             local rc_post = _rc + `rc_post'
 17.             cap frame post post_results (`r') ("predpute_5") (`this_seed')
>  `r(topost)'
 18.             local rc_post = _rc + `rc_post'
 19. 
.             * (v.f) M=50    
.             cap postlca_mi, m(50)
 20.             local rc_post = _rc + `rc_post'
 21.             cap frame post post_results  (`r') ("predpute_50") (`this_seed
> ') `r(topost)'
 22.             local rc_post = _rc + `rc_post'
 23.         }
 24.         else if `_rc_gsem' == 1 exit 1
 25.     }
 26.     _dots `r' `=`rc_gsem'+`rc_post'', reps(`reps')
 27. 
.     timer off 11
 28. }
Simulation replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
.?......?..?.......?.??......?...??.?....?......?.    50

. 
. * (vi) done with simulations
. frame post_results : describe

Contains data
 Observations:           131                  
    Variables:            47                  
-------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
rep             int     %8.0g                 
method          str12   %12s                  
seed            double  %10.0g                
class1pr        double  %10.0g                
class1se        double  %10.0g                
class2pr        double  %10.0g                
class2se        double  %10.0g                
class3pr        double  %10.0g                
class3se        double  %10.0g                
y1cl1pr         double  %10.0g                
y1cl1se         double  %10.0g                
y1cl2pr         double  %10.0g                
y1cl2se         double  %10.0g                
y1cl3pr         double  %10.0g                
y1cl3se         double  %10.0g                
y2cl1pr         double  %10.0g                
y2cl1se         double  %10.0g                
y2cl2pr         double  %10.0g                
y2cl2se         double  %10.0g                
y2cl3pr         double  %10.0g                
y2cl3se         double  %10.0g                
y3cl1pr         double  %10.0g                
y3cl1se         double  %10.0g                
y3cl2pr         double  %10.0g                
y3cl2se         double  %10.0g                
y3cl3pr         double  %10.0g                
y3cl3se         double  %10.0g                
y4cl1pr         double  %10.0g                
y4cl1se         double  %10.0g                
y4cl2pr         double  %10.0g                
y4cl2se         double  %10.0g                
y4cl3pr         double  %10.0g                
y4cl3se         double  %10.0g                
y5cl1pr         double  %10.0g                
y5cl1se         double  %10.0g                
y5cl2pr         double  %10.0g                
y5cl2se         double  %10.0g                
y5cl3pr         double  %10.0g                
y5cl3se         double  %10.0g                
y6cl1pr         double  %10.0g                
y6cl1se         double  %10.0g                
y6cl2pr         double  %10.0g                
y6cl2se         double  %10.0g                
y6cl3pr         double  %10.0g                
y6cl3se         double  %10.0g                
df_min_mi       double  %10.0g                
fmi_max_mi      double  %10.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. frame post_results : summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         rep |        131    25.22901    14.55418          1         50
      method |          0
        seed |        131    4200.802    1757.191        501       5050
    class1pr |        128    .3789425    .1844034      .0548       .804
    class1se |        128    .0169538    .0035678   .0079103   .0267291
-------------+---------------------------------------------------------
    class2pr |        131     .392684    .1554785       .028        .71
    class2se |        131    .0172162    .0035901   .0052195   .0294711
    class3pr |        128    .2426075    .2043336       .024       .916
    class3se |        128    .0139983      .00506   .0048423   .0293828
     y1cl1pr |        128    .7600619    .1480523          0          1
-------------+---------------------------------------------------------
     y1cl1se |        128    .0237758    .0133417          0   .0694529
     y1cl2pr |        131    .2403199    .1152853          0   .4279829
     y1cl2se |        131     .023419    .0105326          0   .0556486
     y1cl3pr |        128    .6559399    .1927288   .2542373          1
     y1cl3se |        128    .0386534    .0268854          0   .1150559
-------------+---------------------------------------------------------
     y2cl1pr |        128    .8423851    .0903614   .6563943          1
     y2cl1se |        128    .0210979    .0122468          0   .0677275
     y2cl2pr |        131    .4676404    .1163006          0   .6412418
     y2cl2se |        131    .0292364    .0110071          0   .0734569
     y2cl3pr |        128    .5376715    .2189196          0          1
-------------+---------------------------------------------------------
     y2cl3se |        128    .0395983     .026017          0   .1163245
     y3cl1pr |        128    .4818401     .107929          0   .7741935
     y3cl1se |        128    .0321694    .0148042          0   .1046395
     y3cl2pr |        131    .3605385    .1180401          0   .4982456
     y3cl2se |        131    .0277529    .0112881          0   .0753557
-------------+---------------------------------------------------------
     y3cl3pr |        128     .765838    .1679896   .4438095          1
     y3cl3se |        128     .032258    .0270174          0   .1583949
     y4cl1pr |        128    .4874129    .1349799          0          1
     y4cl1se |        128    .0314293    .0154305          0   .0904775
     y4cl2pr |        131    .2762797    .1121668          0   .4457799
-------------+---------------------------------------------------------
     y4cl2se |        131    .0252529     .010212          0   .0522632
     y4cl3pr |        128    .7646967    .2039962   .3448276          1
     y4cl3se |        128    .0268724    .0226984          0   .0875487
     y5cl1pr |        128    .8333573    .1288252   .6256219          1
     y5cl1se |        128    .0173363    .0127373          0   .0539213
-------------+---------------------------------------------------------
     y5cl2pr |        131    .3865217    .1262761          0          1
     y5cl2se |        131    .0279664    .0113191          0   .0793112
     y5cl3pr |        128    .2720717    .2135392          0   .6358696
     y5cl3se |        128    .0285728    .0247355          0   .1034322
     y6cl1pr |        128    1.209937    .0659516   1.035231    1.34935
-------------+---------------------------------------------------------
     y6cl1se |        128    .0700136    .0309162   .0367192   .1900817
     y6cl2pr |        131    1.369319    .0616417   1.058148   1.546752
     y6cl2se |        131    .0649501    .0247764   .0379433   .1815925
     y6cl3pr |        128    1.422595     .133536   1.217524   1.810217
     y6cl3se |        128    .1092565    .0594703   .0340284   .3053939
-------------+---------------------------------------------------------
   df_min_mi |         81    71.77643    67.21243    7.10029   195.5778
  fmi_max_mi |         33     .592328    .0970401   .4617039    .762074

. timer list 11
  11:   1223.87 /       50 =      24.4773

. 
. * (vii) analyze the results
. frame change post_results

. encode method, gen(n_method)

. 
. * consistently produced estimates
. bysort rep (method) : gen byte touse3 = (_N==3)

. 
. cap noi save postlca-simul-`reps'
file postlca-simul-50.dta saved

. 
. * class probablity estimates are biased
. mean class1pr if touse3, over(n_method)

Mean estimation                                   Number of obs = 112

---------------------------------------------------------------------
                    |       Mean   Std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.class1pr@n_method |
             modal  |   .3891944   .0328879       .324025    .4543639
        predpute_5  |   .3547211     .02896       .297335    .4121071
       predpute_50  |   .3546063   .0288929      .2973531    .4118595
---------------------------------------------------------------------

. bysort method (rep): sum class1pr if touse3

-------------------------------------------------------------------------------
-> method = modal

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    class1pr |         36    .3891944    .1973271       .067       .804

-------------------------------------------------------------------------------
-> method = predpute_5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    class1pr |         38    .3547211    .1785212      .0548      .7066

-------------------------------------------------------------------------------
-> method = predpute_50

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    class1pr |         38    .3546063    .1781077      .0549     .70186


. * std errors are too small
. mean class1se if touse3, over(n_method)

Mean estimation                                   Number of obs = 112

---------------------------------------------------------------------
                    |       Mean   Std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.class1se@n_method |
             modal  |   .0140028   .0003375      .0133339    .0146717
        predpute_5  |   .0188541   .0005709      .0177229    .0199854
       predpute_50  |   .0179926   .0004903       .017021    .0189642
---------------------------------------------------------------------

. 
. * variable in the model: target 0.3
. mean y1cl2pr if touse3, over(n_method)

Mean estimation                                  Number of obs = 114

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y1cl2pr@n_method |
            modal  |     .17381   .0184109      .1373346    .2102854
       predpute_5  |   .2830272   .0152952      .2527246    .3133298
      predpute_50  |   .2826173   .0153483      .2522095    .3130252
--------------------------------------------------------------------

. bysort method (rep): sum y1cl2pr if touse3

-------------------------------------------------------------------------------
-> method = modal

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y1cl2pr |         38      .17381    .1134927          0   .4030769

-------------------------------------------------------------------------------
-> method = predpute_5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y1cl2pr |         38    .2830272    .0942861          0   .4261345

-------------------------------------------------------------------------------
-> method = predpute_50

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y1cl2pr |         38    .2826173    .0946136          0   .4279829


. mean y1cl2se if touse3, over(n_method)

Mean estimation                                  Number of obs = 114

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y1cl2se@n_method |
            modal  |   .0163096    .001277      .0137796    .0188395
       predpute_5  |   .0282137   .0015969      .0250499    .0313775
      predpute_50  |   .0268219   .0013029      .0242407    .0294031
--------------------------------------------------------------------

. 
. * variable in the model: target 0.5
. mean y4cl1pr if touse3, over(n_method)

Mean estimation                                  Number of obs = 112

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y4cl1pr@n_method |
            modal  |   .4660821    .032796      .4010947    .5310695
       predpute_5  |   .4808426   .0143214      .4524639    .5092213
      predpute_50  |    .481436    .014106      .4534839     .509388
--------------------------------------------------------------------

. bysort method (rep): sum y4cl1pr if touse3

-------------------------------------------------------------------------------
-> method = modal

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y4cl1pr |         36    .4660821    .1967758          0          1

-------------------------------------------------------------------------------
-> method = predpute_5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y4cl1pr |         38    .4808426    .0882828   .2314091   .6363392

-------------------------------------------------------------------------------
-> method = predpute_50

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y4cl1pr |         38     .481436    .0869554    .228918   .6518583


. mean y4cl1se if touse3, over(n_method)

Mean estimation                                  Number of obs = 112

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y4cl1se@n_method |
            modal  |   .0223914    .001569      .0192824    .0255005
       predpute_5  |   .0381943   .0026969      .0328502    .0435384
      predpute_50  |   .0368932   .0025379      .0318641    .0419222
--------------------------------------------------------------------

. 
. * variable not in the model: target 1
. mean y6cl1pr if touse3, over(n_method)

Mean estimation                                  Number of obs = 112

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y6cl1pr@n_method |
            modal  |    1.18559   .0121044      1.161604    1.209575
       predpute_5  |    1.22507   .0101231       1.20501    1.245129
      predpute_50  |   1.217453   .0093614      1.198903    1.236003
--------------------------------------------------------------------

. bysort method (rep): sum y6cl1pr if touse3

-------------------------------------------------------------------------------
-> method = modal

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl1pr |         36     1.18559    .0726266   1.035874   1.335067

-------------------------------------------------------------------------------
-> method = predpute_5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl1pr |         38     1.22507    .0624029   1.035231    1.34935

-------------------------------------------------------------------------------
-> method = predpute_50

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl1pr |         38    1.217453    .0577074    1.06728   1.323826


. mean y6cl1se if touse3, over(n_method)

Mean estimation                                  Number of obs = 112

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y6cl1se@n_method |
            modal  |   .0593503   .0034076      .0525978    .0661028
       predpute_5  |   .0786962   .0057753      .0672521    .0901404
      predpute_50  |   .0776486   .0056026      .0665466    .0887505
--------------------------------------------------------------------

. 
. * variable not in the model: target sqrt(3) == 1.73
. mean y6cl3pr if touse3, over(n_method)

Mean estimation                                  Number of obs = 111

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y6cl3pr@n_method |
            modal  |     1.4633   .0282546      1.407306    1.519294
       predpute_5  |   1.397531    .019723      1.358444    1.436617
      predpute_50  |   1.401446   .0175541      1.366658    1.436234
--------------------------------------------------------------------

. bysort method (rep): sum y6cl3pr if touse3

-------------------------------------------------------------------------------
-> method = modal

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl3pr |         35      1.4633    .1671567   1.257244   1.810217

-------------------------------------------------------------------------------
-> method = predpute_5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl3pr |         38    1.397531    .1215807   1.217524   1.724234

-------------------------------------------------------------------------------
-> method = predpute_50

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     y6cl3pr |         38    1.401446    .1082105    1.26233   1.695043


. mean y6cl3se if touse3, over(n_method)

Mean estimation                                  Number of obs = 111

--------------------------------------------------------------------
                   |       Mean   Std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.y6cl3se@n_method |
            modal  |   .0997236   .0101584       .079592    .1198552
       predpute_5  |   .1189936   .0104268      .0983301    .1396572
      predpute_50  |   .1141739   .0096941      .0949624    .1333855
--------------------------------------------------------------------

. 
. frame change default

. 
. ***********
. log close
      name:  <unnamed>
       log:  D:\home\stephenj\MYDocs\REF\_Stata_Journal_editor\kolenikov_infere
> nce-imputed-latent-classes\2025.03.04.kolenikov_submission\postlca-simul_spj.
> log
  log type:  text
 closed on:   8 Jun 2025, 12:08:00
-------------------------------------------------------------------------------
